app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def create
    @post = Post.new(content: params[:content])
    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "Hola!!!!!"], ["created_at", "2017-12-29 01:24:16.303832"], ["updated_at", "2017-12-29 01:24:16.303832"]]